app.factory( 'ValidationService', [ function()
    {
        var ValidationService = {
            email:              /^(?:[\w\!\#\$\%\&\'\*\+\-\/\=\?\^\`\{\|\}\~]+\.)*[\w\!\#\$\%\&\'\*\+\-\/\=\?\^\`\{\|\}\~]+@(?:(?:(?:[a-zA-Z0-9_](?:[a-zA-Z0-9_\-](?!\.)){0,61}[a-zA-Z0-9_-]?\.)+[a-zA-Z0-9_](?:[a-zA-Z0-9_\-](?!$)){0,61}[a-zA-Z0-9_]?)|(?:\[(?:(?:[01]?\d{1,2}|2[0-4]\d|25[0-5])\.){3}(?:[01]?\d{1,2}|2[0-4]\d|25[0-5])\]))$/,
            password:           /(?=.*[a-z])(?=.*[A-Z]).{6,}|(?=.*[a-zA-Z])(?=.*[1-9]).{6,}/,
            passwordOrEmpty:    /(^$)|(?=.*[a-z])(?=.*[A-Z]).{6,}|(?=.*[a-zA-Z])(?=.*[1-9]).{6,}/,
            classificatorName:  /^[0-9a-zāčēģīķļņōŗšūžA-ZĀČĒĢĪĶĻŅŌŖŠŪŽ\s]{3,60}$/,
            globalTextValue:    /^[A-ZĀČĒĢĪĶĻŅŌŖŠŪŽa-zāčēģīķļņōŗšūž0-9 .,!?\-]{2,}$/,
            number:             /^[0-9]{1,}/,
            fullName:           /^[A-ZĀČĒĢĪĶĻŅŌŖŠŪŽa-zāčēģīķļņōŗšūž]{2,60} [A-ZĀČĒĢĪĶĻŅŌŖŠŪŽa-zāčēģīķļņōŗšūž]{2,60}$/,
            clientName:         /^[A-ZĀČĒĢĪĶĻŅŌŖŠŪŽa-zāčēģīķļņōŗšūž ]{2,60}$/,
            personalCode:       /^[0-9]{6}-[0-9]{5}$/,
            companyName:        /^[A-ZĀČĒĢĪĶĻŅŌŖŠŪŽa-zāčēģīķļņōŗšūž\s]{3,}$/,
            registrationNumber: /^[A-Z0-9]{5,}$/,
            phone:              /^[0-9]{8}$/,
            clock:              /^(?:0?[0-9]|1[0-9]|2[0-3]):[0-5][0-9]$/,
        };

        return ValidationService;
    }] );